{
  "backend/main.mo": "Main Motoko actor for the VibeReel platform, defining data models (UserProfile, Video, Comment) and implementing authenticated endpoints for profile management, video upload, comments, likes, and follows using access control and blob storage mixins.",
  "feature_evidence.json": "JSON report mapping implemented feature IDs to their titles, affected source files, component dependencies, and test IDs, covering mobile layout redesign, vertical video feed, upload page, and comments panel features.",
  "frontend-file-summaries.txt": "A JSON document providing short descriptions of each frontend source file, summarizing the purpose and key implementation details of components, hooks, pages, and utilities in the frontend.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for the design system's color tokens in both light and dark themes, plus global border and background defaults.",
  "frontend/index.html": "HTML entry point for the VibeReel React app, setting up the dark-mode body, root div, Google Fonts preconnect, and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for Home, Explore, Upload, and Profile pages, wrapping everything in a phone-width app-shell container with a Toaster notification component.",
  "frontend/src/components/ActionButtons.tsx": "Vertical action button bar for video cards providing like, comment, share, and follow actions with optimistic UI updates, AuthGuard protection for authenticated actions, and formatted count display.",
  "frontend/src/components/AuthGuard.tsx": "Wrapper component that intercepts clicks from unauthenticated users and displays a login prompt dialog with Internet Identity login before allowing protected actions to proceed.",
  "frontend/src/components/CommentInput.tsx": "A form component for submitting video comments with a textarea (300 char limit) and send button, using the useAddComment mutation hook and supporting Enter-to-submit.",
  "frontend/src/components/CommentItem.tsx": "Renders a single comment with the author's avatar, display name (fetched via useGetUserProfile), timestamp, and comment text.",
  "frontend/src/components/CommentsPanel.tsx": "A bottom-drawer panel that displays a scrollable list of comments for a video, with loading skeletons, an empty state, and a pinned CommentInput (guarded by auth).",
  "frontend/src/components/EditProfileModal.tsx": "A dialog modal for editing the current user's profile fields (username, bio, avatar URL), submitting changes via the useSaveCallerUserProfile mutation.",
  "frontend/src/components/Layout.tsx": "The root app layout providing a top header with branding and login button, a main content outlet, and a bottom tab navigation bar for Home, Explore, Upload, and Profile routes.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing a spinner during the login process and clearing the React Query cache on logout.",
  "frontend/src/components/ProfileHeader.tsx": "Displays a user's profile avatar, username, bio, follower/following/video stats, and an Edit Profile or Follow action button depending on whether it is the viewer's own profile.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that prompts new users to set up their profile by entering a username and optional bio, then saves the profile via the `useSaveCallerUserProfile` mutation.",
  "frontend/src/components/UploadProgress.tsx": "A UI component that displays the current video upload state (validating, uploading, processing, success, or error) with appropriate icons, progress bars, and error messages.",
  "frontend/src/components/VideoCard.tsx": "A full-screen video card component that handles auto-play/pause based on active state, mute toggling, play/pause flash animation, and displays uploader info with navigation to their profile.",
  "frontend/src/components/VideoGrid.tsx": "A responsive 2-column grid component that renders a list of video thumbnails with title, like count, and duration, navigating to the feed with the selected video on click.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAuth.ts": "A convenience hook that combines Internet Identity authentication state with the caller's user profile query, exposing auth status, profile data, and a `needsProfileSetup` flag.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage ICP AuthClient lifecycle, login/logout flows, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks and mutations for user profiles and video uploads, including a client-side video registry for storing and retrieving uploaded video metadata since the backend lacks a list endpoint.",
  "frontend/src/index.css": "Global CSS file that imports Inter and Space Grotesk fonts, sets up Tailwind, defines CSS custom properties for a dark-themed design system (colors, sidebar, vibe accent), and provides utility classes for the app shell, feed scroll-snap, video overlays, and glass panels.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/ExplorePage.tsx": "Explore page that polls the video registry every 5 seconds and displays a searchable, sortable (trending/recent) grid of videos.",
  "frontend/src/pages/HomePage.tsx": "Home feed page that renders videos in a vertical scroll-snap feed, using an IntersectionObserver to track the active video and polling the registry every 5 seconds.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page that displays a user's profile header and uploaded video grid, supporting own-profile editing and following other users, with loading and not-found states.",
  "frontend/src/pages/UploadPage.tsx": "Upload page that handles video file selection with validation, collects title/description, tracks chunked upload progress through multiple states (validating, uploading, processing, success), and redirects to home on success.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL parameters from both query strings and hash-based routes, persist them to sessionStorage, and clean sensitive parameters from the URL hash without reloading.",
  "frontend/src/utils/videoValidation.ts": "Provides utility functions for validating video files (type, size, duration limits) and formatting durations, counts, and timestamps for display.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark-mode design system with custom OKLCH-based colors, fonts, animations, and plugins for a short-form video platform UI.",
  "project_state.json": "Tracks the current state of a TikTok-style video sharing platform project, including version, architectural notes, known issues (broken video upload), and a list of implemented features."
}